ГТС/УТГТС/InformationRegisters/СтавкиДисконтирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтавкиДисконтирования</Name>
			<Comment>Дополняет учетную политику финансового учета ставками дисконтирования в разных валютах</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаДисконтирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/СтавкиДисконтирования/Forms/РедактированиеСтавокДисконтирования/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Период = Параметры.Период;
	
	Для Каждого СтрокаСтавки Из Параметры.ЗначенияСтавокДисконтирования Цикл
		НоваяСтрока = ЗначенияСтавокДисконтирования.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСтавки);
	КонецЦикла;

	ТолькоПросмотр = НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СтавкиДисконтирования);
	
	Элементы.ЗначенияСтавокДисконтирования.ТолькоПросмотр = ТолькоПросмотр;
	ИспользоватьНесколькоВалют = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют");
	Элементы.ЗначенияСтавокДисконтированияВалюта.Видимость = ИспользоватьНесколькоВалют;
	Если Не ИспользоватьНесколькоВалют Тогда
		ВалютаПоУмолчанию = ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию();
	КонецЕсли;
	
	Заголовок = НСтр("ru='Ставки дисконтирования для'") + " " + Организация;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначенияСтавокДисконтирования

&НаКлиенте
Процедура ЗначенияСтавокДисконтированияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Не ИспользоватьНесколькоВалют И ЗначенияСтавокДисконтирования.Количество() > 0 Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияСтавокДисконтированияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда) 
	
	Если Модифицированность Тогда
		
		Если ИспользоватьНесколькоВалют Тогда
			
			ОчиститьСообщения();
			Отказ = Ложь;
			ОшибкиЗаполнения = ПроверкаЗаполнения();
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ОшибкиЗаполнения, Отказ);
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		ВыбранноеЗначение = Новый Массив;
		Для Каждого СтрокаСтавки Из ЗначенияСтавокДисконтирования Цикл
			НоваяСтрока = Новый Структура("Валюта, СтавкаДисконтирования");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСтавки);
			Если Не ИспользоватьНесколькоВалют Тогда
				НоваяСтрока.Валюта = ВалютаПоУмолчанию;
			КонецЕсли;
			ВыбранноеЗначение.Добавить(НоваяСтрока);
		КонецЦикла;
		
		ОповеститьОВыборе(ВыбранноеЗначение);
		
	Иначе
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПроверкаЗаполнения()
	
	ОшибкиЗаполнения = Неопределено;
	
	МассивВалют = Новый Массив;
	ШаблонОшибкиДублирования = НСтр("ru='Ставка дисконтирования для валюты %1 уже указана'");
	
	Для Каждого СтрокаСтавки Из ЗначенияСтавокДисконтирования Цикл
		Если СтрокаСтавки.Валюта.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
				ОшибкиЗаполнения,
				"ЗначенияСтавокДисконтирования[%1].Валюта",
				НСтр("ru='Поле Валюта не заполнено'"),
				,
				ЗначенияСтавокДисконтирования.Индекс(СтрокаСтавки));
		ИначеЕсли МассивВалют.Найти(СтрокаСтавки.Валюта) = Неопределено Тогда
			МассивВалют.Добавить(СтрокаСтавки.Валюта);
		Иначе
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
				ОшибкиЗаполнения,
				"ЗначенияСтавокДисконтирования[%1].Валюта",
				СтрШаблон(ШаблонОшибкиДублирования, СтрокаСтавки.Валюта),
				,
				ЗначенияСтавокДисконтирования.Индекс(СтрокаСтавки));
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОшибкиЗаполнения;
	
КонецФункции

#КонецОбласти
